Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/stm32/STM32F100.h
/*-----------------------------------------------------------------------*/
/* STM31F100 Register Definitions and Cortex-M3 Supplement Definitions   */
/*       This file is a non-copyrighted public domain software           */
/*-----------------------------------------------------------------------*/

#ifndef __STM32F100
#define __STM32F100
#include <stdint.h>

#define	USE_SV_SERVICE	0	/* Enable supervisor service for user mode task */


/* CRC calculation unit */
#define CRC_DR		(*(volatile uint32_t*)0x40023000)
#define CRC_IDR		(*(volatile uint32_t*)0x40023004)
#define CRC_CR		(*(volatile uint32_t*)0x40023008)


/* Reset and clock control RCC */
#define RCC_CR			(*(volatile uint32_t*)0x40021000)
#define RCC_CFGR		(*(volatile uint32_t*)0x40021004)
#define RCC_CIR			(*(volatile uint32_t*)0x40021008)
#define RCC_APB2RSTR	(*(volatile uint32_t*)0x4002100C)
#define RCC_APB1RSTR	(*(volatile uint32_t*)0x40021010)
#define RCC_AHBENR		(*(volatile uint32_t*)0x40021014)
#define RCC_APB2ENR		(*(volatile uint32_t*)0x40021018)
#define RCC_APB1ENR		(*(volatile uint32_t*)0x4002101C)
#define RCC_BDCR		(*(volatile uint32_t*)0x40021020)
#define RCC_CSR			(*(volatile uint32_t*)0x40021024)
#define RCC_CFGR2		(*(volatile uint32_t*)0x4002102C)


/* DMA1 */
#define DMA1_ISR		(*(volatile uint32_t*)0x40020000)
#define DMA1_IFCR		(*(volatile uint32_t*)0x40020004)
#define DMA1_CCR1		(*(volatile uint32_t*)0x40020008)
#define DMA1_CNDTR1		(*(volatile uint32_t*)0x4002000C)
#define DMA1_CPAR1		(*(volatile uint32_t*)0x40020010)
#define DMA1_CMAR1		(*(volatile uint32_t*)0x40020014)
#define DMA1_CCR2		(*(volatile uint32_t*)0x4002001C)
#define DMA1_CNDTR2		(*(volatile uint32_t*)0x40020020)
#define DMA1_CPAR2		(*(volatile uint32_t*)0x40020024)
#define DMA1_CMAR2		(*(volatile uint32_t*)0x40020028)
#define DMA1_CCR3		(*(volatile uint32_t*)0x40020030)
#define DMA1_CNDTR3		(*(volatile uint32_t*)0x40020034)
#define DMA1_CPAR3		(*(volatile uint32_t*)0x40020038)
#define DMA1_CMAR3		(*(volatile uint32_t*)0x4002003C)
#define DMA1_CCR4		(*(volatile uint32_t*)0x40020044)
#define DMA1_CNDTR4		(*(volatile uint32_t*)0x40020048)
#define DMA1_CPAR4		(*(volatile uint32_t*)0x4002004C)
#define DMA1_CMAR4		(*(volatile uint32_t*)0x40020050)
#define DMA1_CCR5		(*(volatile uint32_t*)0x40020058)
#define DMA1_CNDTR5		(*(volatile uint32_t*)0x4002005C)
#define DMA1_CPAR5		(*(volatile uint32_t*)0x40020060)
#define DMA1_CMAR5		(*(volatile uint32_t*)0x40020064)
#define DMA1_CCR6		(*(volatile uint32_t*)0x4002006C)
#define DMA1_CNDTR6		(*(volatile uint32_t*)0x40020070)
#define DMA1_CPAR6		(*(volatile uint32_t*)0x40020074)
#define DMA1_CMAR6		(*(volatile uint32_t*)0x40020078)
#define DMA1_CCR7		(*(volatile uint32_t*)0x40020080)
#define DMA1_CNDTR7		(*(volatile uint32_t*)0x40020084)
#define DMA1_CPAR7		(*(volatile uint32_t*)0x40020088)
#define DMA1_CMAR7		(*(volatile uint32_t*)0x4002008C)


/* DMA2 */
#define DMA2_ISR		(*(volatile uint32_t*)0x40020400)
#define DMA2_IFCR		(*(volatile uint32_t*)0x40020404)
#define DMA2_CCR1		(*(volatile uint32_t*)0x40020408)
#define DMA2_CNDTR1		(*(volatile uint32_t*)0x4002040C)
#define DMA2_CPAR1		(*(volatile uint32_t*)0x40020410)
#define DMA2_CMAR1		(*(volatile uint32_t*)0x40020414)
#define DMA2_CCR2		(*(volatile uint32_t*)0x4002041C)
#define DMA2_CNDTR2		(*(volatile uint32_t*)0x40020420)
#define DMA2_CPAR2		(*(volatile uint32_t*)0x40020424)
#define DMA2_CMAR2		(*(volatile uint32_t*)0x40020428)
#define DMA2_CCR3		(*(volatile uint32_t*)0x40020430)
#define DMA2_CNDTR3		(*(volatile uint32_t*)0x40020434)
#define DMA2_CPAR3		(*(volatile uint32_t*)0x40020438)
#define DMA2_CMAR3		(*(volatile uint32_t*)0x4002043C)
#define DMA2_CCR4		(*(volatile uint32_t*)0x40020444)
#define DMA2_CNDTR4		(*(volatile uint32_t*)0x40020448)
#define DMA2_CPAR4		(*(volatile uint32_t*)0x4002044C)
#define DMA2_CMAR4		(*(volatile uint32_t*)0x40020450)
#define DMA2_CCR5		(*(volatile uint32_t*)0x40020458)
#define DMA2_CNDTR5		(*(volatile uint32_t*)0x4002045C)
#define DMA2_CPAR5		(*(volatile uint32_t*)0x40020460)
#define DMA2_CMAR5		(*(volatile uint32_t*)0x40020464)


/* TIM1 */
#define TIM1_CR1	(*(volatile uint16_t*)0x40012C00)
#define TIM1_CR2	(*(volatile uint16_t*)0x40012C04)
#define TIM1_SMCR	(*(volatile uint16_t*)0x40012C08)
#define TIM1_DIER	(*(volatile uint16_t*)0x40012C0C)
#define TIM1_SR		(*(volatile uint16_t*)0x40012C10)
#define TIM1_EGR	(*(volatile uint16_t*)0x40012C14)
#define TIM1_CCMR1	(*(volatile uint16_t*)0x40012C18)
#define TIM1_CCMR2	(*(volatile uint16_t*)0x40012C1C)
#define TIM1_CCER	(*(volatile uint16_t*)0x40012C20)
#define TIM1_CNT	(*(volatile uint16_t*)0x40012C24)
#define TIM1_PSC	(*(volatile uint16_t*)0x40012C28)
#define TIM1_ARR	(*(volatile uint16_t*)0x40012C2C)
#define TIM1_RCR	(*(volatile uint16_t*)0x40012C30)
#define TIM1_CCR1	(*(volatile uint16_t*)0x40012C34)
#define TIM1_CCR2	(*(volatile uint16_t*)0x40012C38)
#define TIM1_CCR3	(*(volatile uint16_t*)0x40012C3C)
#define TIM1_CCR4	(*(volatile uint16_t*)0x40012C40)
#define TIM1_BDTR	(*(volatile uint16_t*)0x40012C44)
#define TIM1_DCR	(*(volatile uint16_t*)0x40012C48)
#define TIM1_DMAR	(*(volatile uint16_t*)0x40012C4C)


/* TIM2 */
#define TIM2_CR1	(*(volatile uint16_t*)0x40000000)
#define TIM2_CR2	(*(volatile uint16_t*)0x40000004)
#define TIM2_SMCR	(*(volatile uint16_t*)0x40000008)
#define TIM2_DIER	(*(volatile uint16_t*)0x4000000C)
#define TIM2_SR		(*(volatile uint16_t*)0x40000010)
#define TIM2_EGR	(*(volatile uint16_t*)0x40000014)
#define TIM2_CCMR1	(*(volatile uint16_t*)0x40000018)
#define TIM2_CCMR2	(*(volatile uint16_t*)0x4000001C)
#define TIM2_CCER	(*(volatile uint16_t*)0x40000020)
#define TIM2_CNT	(*(volatile uint16_t*)0x40000024)
#define TIM2_PSC	(*(volatile uint16_t*)0x40000028)
#define TIM2_ARR	(*(volatile uint16_t*)0x4000002C)
#define TIM2_CCR1	(*(volatile uint16_t*)0x40000034)
#define TIM2_CCR2	(*(volatile uint16_t*)0x40000038)
#define TIM2_CCR3	(*(volatile uint16_t*)0x4000003C)
#define TIM2_CCR4	(*(volatile uint16_t*)0x40000040)
#define TIM2_DCR	(*(volatile uint16_t*)0x40000048)
#define TIM2_DMAR	(*(volatile uint16_t*)0x4000004C)


/* TIM3 */
#define TIM3_CR1	(*(volatile uint16_t*)0x40000400)
#define TIM3_CR2	(*(volatile uint16_t*)0x40000404)
#define TIM3_SMCR	(*(volatile uint16_t*)0x40000408)
#define TIM3_DIER	(*(volatile uint16_t*)0x4000040C)
#define TIM3_SR		(*(volatile uint16_t*)0x40000410)
#define TIM3_EGR	(*(volatile uint16_t*)0x40000414)
#define TIM3_CCMR1	(*(volatile uint16_t*)0x40000418)
#define TIM3_CCMR2	(*(volatile uint16_t*)0x4000041C)
#define TIM3_CCER	(*(volatile uint16_t*)0x40000420)
#define TIM3_CNT	(*(volatile uint16_t*)0x40000424)
#define TIM3_PSC	(*(volatile uint16_t*)0x40000428)
#define TIM3_ARR	(*(volatile uint16_t*)0x4000042C)
#define TIM3_CCR1	(*(volatile uint16_t*)0x40000434)
#define TIM3_CCR2	(*(volatile uint16_t*)0x40000438)
#define TIM3_CCR3	(*(volatile uint16_t*)0x4000043C)
#define TIM3_CCR4	(*(volatile uint16_t*)0x40000440)
#define TIM3_DCR	(*(volatile uint16_t*)0x40000448)
#define TIM3_DMAR	(*(volatile uint16_t*)0x4000044C)


/* TIM4 */
#define TIM4_CR1	(*(volatile uint16_t*)0x40000800)
#define TIM4_CR2	(*(volatile uint16_t*)0x40000804)
#define TIM4_SMCR	(*(volatile uint16_t*)0x40000808)
#define TIM4_DIER	(*(volatile uint16_t*)0x4000080C)
#define TIM4_SR		(*(volatile uint16_t*)0x40000810)
#define TIM4_EGR	(*(volatile uint16_t*)0x40000814)
#define TIM4_CCMR1	(*(volatile uint16_t*)0x40000818)
#define TIM4_CCMR2	(*(volatile uint16_t*)0x4000081C)
#define TIM4_CCER	(*(volatile uint16_t*)0x40000820)
#define TIM4_CNT	(*(volatile uint16_t*)0x40000824)
#define TIM4_PSC	(*(volatile uint16_t*)0x40000828)
#define TIM4_ARR	(*(volatile uint16_t*)0x4000082C)
#define TIM4_CCR1	(*(volatile uint16_t*)0x40000834)
#define TIM4_CCR2	(*(volatile uint16_t*)0x40000838)
#define TIM4_CCR3	(*(volatile uint16_t*)0x4000083C)
#define TIM4_CCR4	(*(volatile uint16_t*)0x40000840)
#define TIM4_DCR	(*(volatile uint16_t*)0x40000848)
#define TIM4_DMAR	(*(volatile uint16_t*)0x4000084C)


/* TIM5 */
#define TIM5_CR1	(*(volatile uint16_t*)0x40000C00)
#define TIM5_CR2	(*(volatile uint16_t*)0x40000C04)
#define TIM5_SMCR	(*(volatile uint16_t*)0x40000C08)
#define TIM5_DIER	(*(volatile uint16_t*)0x40000C0C)
#define TIM5_SR		(*(volatile uint16_t*)0x40000C10)
#define TIM5_EGR	(*(volatile uint16_t*)0x40000C14)
#define TIM5_CCMR1	(*(volatile uint16_t*)0x40000C18)
#define TIM5_CCMR2	(*(volatile uint16_t*)0x40000C1C)
#define TIM5_CCER	(*(volatile uint16_t*)0x40000C20)
#define TIM5_CNT	(*(volatile uint16_t*)0x40000C24)
#define TIM5_PSC	(*(volatile uint16_t*)0x40000C28)
#define TIM5_ARR	(*(volatile uint16_t*)0x40000C2C)
#define TIM5_CCR1	(*(volatile uint16_t*)0x40000C34)
#define TIM5_CCR2	(*(volatile uint16_t*)0x40000C38)
#define TIM5_CCR3	(*(volatile uint16_t*)0x40000C3C)
#define TIM5_CCR4	(*(volatile uint16_t*)0x40000C40)
#define TIM5_DCR	(*(volatile uint16_t*)0x40000C48)
#define TIM5_DMAR	(*(volatile uint16_t*)0x40000C4C)


