Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/stm32/STM32F100.h
/* TIM6 */
#define TIM6_CR1	(*(volatile uint16_t*)0x40001000)
#define TIM6_CR2	(*(volatile uint16_t*)0x40001004)
#define TIM6_DIER	(*(volatile uint16_t*)0x4000100C)
#define TIM6_SR		(*(volatile uint16_t*)0x40001010)
#define TIM6_EGR	(*(volatile uint16_t*)0x40001014)
#define TIM6_CNT	(*(volatile uint16_t*)0x40001024)
#define TIM6_PSC	(*(volatile uint16_t*)0x40001028)
#define TIM6_ARR	(*(volatile uint16_t*)0x4000102C)
#define TIM6_CCR1	(*(volatile uint16_t*)0x40001034)
#define TIM6_CCR2	(*(volatile uint16_t*)0x40001038)
#define TIM6_CCR3	(*(volatile uint16_t*)0x4000103C)
#define TIM6_CCR4	(*(volatile uint16_t*)0x40001040)
#define TIM6_DCR	(*(volatile uint16_t*)0x40001048)
#define TIM6_DMAR	(*(volatile uint16_t*)0x4000104C)


/* TIM7 */
#define TIM7_CR1	(*(volatile uint16_t*)0x40001400)
#define TIM7_CR2	(*(volatile uint16_t*)0x40001404)
#define TIM7_DIER	(*(volatile uint16_t*)0x4000140C)
#define TIM7_SR		(*(volatile uint16_t*)0x40001410)
#define TIM7_EGR	(*(volatile uint16_t*)0x40001414)
#define TIM7_CNT	(*(volatile uint16_t*)0x40001424)
#define TIM7_PSC	(*(volatile uint16_t*)0x40001428)
#define TIM7_ARR	(*(volatile uint16_t*)0x4000142C)
#define TIM7_CCR1	(*(volatile uint16_t*)0x40001434)
#define TIM7_CCR2	(*(volatile uint16_t*)0x40001438)
#define TIM7_CCR3	(*(volatile uint16_t*)0x4000143C)
#define TIM7_CCR4	(*(volatile uint16_t*)0x40001440)
#define TIM7_DCR	(*(volatile uint16_t*)0x40001448)
#define TIM7_DMAR	(*(volatile uint16_t*)0x4000144C)


/* TIM12 */
#define TIM12_CR1	(*(volatile uint16_t*)0x40001800)
#define TIM12_CR2	(*(volatile uint16_t*)0x40001804)
#define TIM12_SMCR	(*(volatile uint16_t*)0x40001808)
#define TIM12_DIER	(*(volatile uint16_t*)0x4000180C)
#define TIM12_SR	(*(volatile uint16_t*)0x40001810)
#define TIM12_EGR	(*(volatile uint16_t*)0x40001814)
#define TIM12_CCMR1	(*(volatile uint16_t*)0x40001818)
#define TIM12_CCER	(*(volatile uint16_t*)0x40001820)
#define TIM12_CNT	(*(volatile uint16_t*)0x40001824)
#define TIM12_PSC	(*(volatile uint16_t*)0x40001828)
#define TIM12_ARR	(*(volatile uint16_t*)0x4000182C)
#define TIM12_CCR1	(*(volatile uint16_t*)0x40001834)
#define TIM12_CCR2	(*(volatile uint16_t*)0x40001838)


/* TIM13 */
#define TIM13_CR1	(*(volatile uint16_t*)0x40001C00)
#define TIM13_DIER	(*(volatile uint16_t*)0x40001C0C)
#define TIM13_SR	(*(volatile uint16_t*)0x40001C10)
#define TIM13_EGR	(*(volatile uint16_t*)0x40001C14)
#define TIM13_CCMR1	(*(volatile uint16_t*)0x40001C18)
#define TIM13_CCER	(*(volatile uint16_t*)0x40001C20)
#define TIM13_CNT	(*(volatile uint16_t*)0x40001C24)
#define TIM13_PSC	(*(volatile uint16_t*)0x40001C28)
#define TIM13_ARR	(*(volatile uint16_t*)0x40001C2C)
#define TIM13_CCR1	(*(volatile uint16_t*)0x40001C34)


/* TIM14 */
#define TIM14_CR1	(*(volatile uint16_t*)0x40002000)
#define TIM14_DIER	(*(volatile uint16_t*)0x4000200C)
#define TIM14_SR	(*(volatile uint16_t*)0x40002010)
#define TIM14_EGR	(*(volatile uint16_t*)0x40002014)
#define TIM14_CCMR1	(*(volatile uint16_t*)0x40002018)
#define TIM14_CCER	(*(volatile uint16_t*)0x40002020)
#define TIM14_CNT	(*(volatile uint16_t*)0x40002024)
#define TIM14_PSC	(*(volatile uint16_t*)0x40002028)
#define TIM14_ARR	(*(volatile uint16_t*)0x4000202C)
#define TIM14_CCR1	(*(volatile uint16_t*)0x40002034)


/* TIM15 */
#define TIM15_CR1	(*(volatile uint16_t*)0x40014000)
#define TIM15_CR2	(*(volatile uint16_t*)0x40014004)
#define TIM15_SMCR	(*(volatile uint16_t*)0x40014008)
#define TIM15_DIER	(*(volatile uint16_t*)0x4001400C)
#define TIM15_SR	(*(volatile uint16_t*)0x40014010)
#define TIM15_EGR	(*(volatile uint16_t*)0x40014014)
#define TIM15_CCMR1	(*(volatile uint16_t*)0x40014018)
#define TIM15_CCER	(*(volatile uint16_t*)0x40014020)
#define TIM15_CNT	(*(volatile uint16_t*)0x40014024)
#define TIM15_PSC	(*(volatile uint16_t*)0x40014028)
#define TIM15_ARR	(*(volatile uint16_t*)0x4001402C)
#define TIM15_CCR1	(*(volatile uint16_t*)0x40014034)
#define TIM15_CCR2	(*(volatile uint16_t*)0x40014038)
#define TIM15_BDTR	(*(volatile uint16_t*)0x40014044)
#define TIM15_DCR	(*(volatile uint16_t*)0x40014048)
#define TIM15_DMAR	(*(volatile uint16_t*)0x4001404C)


/* TIM16 */
#define TIM16_CR1	(*(volatile uint16_t*)0x40014400)
#define TIM16_CR2	(*(volatile uint16_t*)0x40014404)
#define TIM16_SMCR	(*(volatile uint16_t*)0x40014408)
#define TIM16_DIER	(*(volatile uint16_t*)0x4001440C)
#define TIM16_SR	(*(volatile uint16_t*)0x40014410)
#define TIM16_EGR	(*(volatile uint16_t*)0x40014414)
#define TIM16_CCMR1	(*(volatile uint16_t*)0x40014418)
#define TIM16_CCER	(*(volatile uint16_t*)0x40014420)
#define TIM16_CNT	(*(volatile uint16_t*)0x40014424)
#define TIM16_PSC	(*(volatile uint16_t*)0x40014428)
#define TIM16_ARR	(*(volatile uint16_t*)0x4001442C)
#define TIM16_RCR	(*(volatile uint16_t*)0x40014430)
#define TIM16_CCR1	(*(volatile uint16_t*)0x40014434)
#define TIM16_BDTR	(*(volatile uint16_t*)0x40014444)
#define TIM16_DCR	(*(volatile uint16_t*)0x40014448)
#define TIM16_DMAR	(*(volatile uint16_t*)0x4001444C)


/* TIM17 */
#define TIM17_CR1	(*(volatile uint16_t*)0x40014800)
#define TIM17_CR2	(*(volatile uint16_t*)0x40014804)
#define TIM17_SMCR	(*(volatile uint16_t*)0x40014808)
#define TIM17_DIER	(*(volatile uint16_t*)0x4001480C)
#define TIM17_SR	(*(volatile uint16_t*)0x40014810)
#define TIM17_EGR	(*(volatile uint16_t*)0x40014814)
#define TIM17_CCMR1	(*(volatile uint16_t*)0x40014818)
#define TIM17_CCER	(*(volatile uint16_t*)0x40014820)
#define TIM17_CNT	(*(volatile uint16_t*)0x40014824)
#define TIM17_PSC	(*(volatile uint16_t*)0x40014828)
#define TIM17_ARR	(*(volatile uint16_t*)0x4001482C)
#define TIM17_RCR	(*(volatile uint16_t*)0x40014830)
#define TIM17_CCR1	(*(volatile uint16_t*)0x40014834)
#define TIM17_BDTR	(*(volatile uint16_t*)0x40014844)
#define TIM17_DCR	(*(volatile uint16_t*)0x40014848)
#define TIM17_DMAR	(*(volatile uint16_t*)0x4001484C)


/* RTC */
#define RTC_CRH		(*(volatile uint16_t*)0x40002800)
#define RTC_CRL		(*(volatile uint16_t*)0x40002804)
#define RTC_PRLH	(*(volatile uint16_t*)0x40002808)
#define RTC_PRLL	(*(volatile uint16_t*)0x4000280C)
#define RTC_DIVH	(*(volatile uint16_t*)0x40002810)
#define RTC_DIVL	(*(volatile uint16_t*)0x40002814)
#define RTC_CNTH	(*(volatile uint16_t*)0x40002818)
#define RTC_CNTL	(*(volatile uint16_t*)0x4000281C)
#define RTC_ALRH	(*(volatile uint16_t*)0x40002820)
#define RTC_ALRL	(*(volatile uint16_t*)0x40002824)


/* Window watchdog */
#define WWDG_CR		(*(volatile uint16_t*)0x40002C00)
#define WWDG_CFR	(*(volatile uint16_t*)0x40002C04)
#define WWDG_SR		(*(volatile uint16_t*)0x40002C08)


/* Independent watchdog */
#define IWDG_KR		(*(volatile uint16_t*)0x40003000)
#define IWDG_PR		(*(volatile uint16_t*)0x40003004)
#define IWDG_RLR	(*(volatile uint16_t*)0x40003008)
#define IWDG_SR		(*(volatile uint16_t*)0x4000300C)


/* USART1 */
#define USART1_SR	(*(volatile uint16_t*)0x40013800)
#define USART1_DR	(*(volatile uint16_t*)0x40013804)
#define USART1_BRR	(*(volatile uint16_t*)0x40013808)
#define USART1_CR1	(*(volatile uint16_t*)0x4001380C)
#define USART1_CR2	(*(volatile uint16_t*)0x40013810)
#define USART1_CR3	(*(volatile uint16_t*)0x40013814)
#define USART1_GTPR	(*(volatile uint16_t*)0x40013818)


