Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/stm32/STM32F100.h
/* USART2 */
#define USART2_SR	(*(volatile uint16_t*)0x40004400)
#define USART2_DR	(*(volatile uint16_t*)0x40004404)
#define USART2_BRR	(*(volatile uint16_t*)0x40004408)
#define USART2_CR1	(*(volatile uint16_t*)0x4000440C)
#define USART2_CR2	(*(volatile uint16_t*)0x40004410)
#define USART2_CR3	(*(volatile uint16_t*)0x40004414)
#define USART2_GTPR	(*(volatile uint16_t*)0x40004418)


/* USART3 */
#define USART3_SR	(*(volatile uint16_t*)0x40004800)
#define USART3_DR	(*(volatile uint16_t*)0x40004804)
#define USART3_BRR	(*(volatile uint16_t*)0x40004808)
#define USART3_CR1	(*(volatile uint16_t*)0x4000480C)
#define USART3_CR2	(*(volatile uint16_t*)0x40004810)
#define USART3_CR3	(*(volatile uint16_t*)0x40004814)
#define USART3_GTPR	(*(volatile uint16_t*)0x40004818)


/* UART4 */
#define UART4_SR	(*(volatile uint16_t*)0x40004C00)
#define UART4_DR	(*(volatile uint16_t*)0x40004C04)
#define UART4_BRR	(*(volatile uint16_t*)0x40004C08)
#define UART4_CR1	(*(volatile uint16_t*)0x40004C0C)
#define UART4_CR2	(*(volatile uint16_t*)0x40004C10)
#define UART4_CR3	(*(volatile uint16_t*)0x40004C14)
#define UART4_GTPR	(*(volatile uint16_t*)0x40004C18)


/* UART5 */
#define UART5_SR	(*(volatile uint16_t*)0x40005000)
#define UART5_DR	(*(volatile uint16_t*)0x40005004)
#define UART5_BRR	(*(volatile uint16_t*)0x40005008)
#define UART5_CR1	(*(volatile uint16_t*)0x4000500C)
#define UART5_CR2	(*(volatile uint16_t*)0x40005010)
#define UART5_CR3	(*(volatile uint16_t*)0x40005014)
#define UART5_GTPR	(*(volatile uint16_t*)0x40005018)


/* I2C1 */
#define I2C1_CR1	(*(volatile uint16_t*)0x40005400)
#define I2C1_CR2	(*(volatile uint16_t*)0x40005404)
#define I2C1_OAR1	(*(volatile uint16_t*)0x40005408)
#define I2C1_OAR2	(*(volatile uint16_t*)0x4000540C)
#define I2C1_DR		(*(volatile uint16_t*)0x40005410)
#define I2C1_SR1	(*(volatile uint16_t*)0x40005414)
#define I2C1_SR2	(*(volatile uint16_t*)0x40005418)
#define I2C1_CCR	(*(volatile uint16_t*)0x4000541C)
#define I2C1_TRISE	(*(volatile uint16_t*)0x40005420)


/* I2C2 */
#define I2C2_CR1	(*(volatile uint16_t*)0x40005800)
#define I2C2_CR2	(*(volatile uint16_t*)0x40005804)
#define I2C2_OAR1	(*(volatile uint16_t*)0x40005808)
#define I2C2_OAR2	(*(volatile uint16_t*)0x4000580C)
#define I2C2_DR		(*(volatile uint16_t*)0x40005810)
#define I2C2_SR1	(*(volatile uint16_t*)0x40005814)
#define I2C2_SR2	(*(volatile uint16_t*)0x40005818)
#define I2C2_CCR	(*(volatile uint16_t*)0x4000581C)
#define I2C2_TRISE	(*(volatile uint16_t*)0x40005820)


/* SPI1 */
#define SPI1_CR1	(*(volatile uint16_t*)0x40013000)
#define SPI1_CR2	(*(volatile uint16_t*)0x40013004)
#define SPI1_SR		(*(volatile uint16_t*)0x40013008)
#define SPI1_DR		(*(volatile uint16_t*)0x4001300C)
#define SPI1_CRCPR	(*(volatile uint16_t*)0x40013010)
#define SPI1_RXCRCR	(*(volatile uint16_t*)0x40013014)
#define SPI1_TXCRCR	(*(volatile uint16_t*)0x40013018)


/* SPI2 */
#define SPI2_CR1	(*(volatile uint16_t*)0x40003800)
#define SPI2_CR2	(*(volatile uint16_t*)0x40003804)
#define SPI2_SR		(*(volatile uint16_t*)0x40003808)
#define SPI2_DR		(*(volatile uint16_t*)0x4000380C)
#define SPI2_CRCPR	(*(volatile uint16_t*)0x40003810)
#define SPI2_RXCRCR	(*(volatile uint16_t*)0x40003814)
#define SPI2_TXCRCR	(*(volatile uint16_t*)0x40003818)


/* SPI3 */
#define SPI3_CR1	(*(volatile uint16_t*)0x40003C00)
#define SPI3_CR2	(*(volatile uint16_t*)0x40003C04)
#define SPI3_SR		(*(volatile uint16_t*)0x40003C08)
#define SPI3_DR		(*(volatile uint16_t*)0x40003C0C)
#define SPI3_CRCPR	(*(volatile uint16_t*)0x40003C10)
#define SPI3_RXCRCR	(*(volatile uint16_t*)0x40003C14)
#define SPI3_TXCRCR	(*(volatile uint16_t*)0x40003C18)


/* ADC1 */
#define ADC1_SR		(*(volatile uint32_t*)0x40012400)
#define ADC1_CR1	(*(volatile uint32_t*)0x40012404)
#define ADC1_CR2	(*(volatile uint32_t*)0x40012408)
#define ADC1_SMPR1	(*(volatile uint32_t*)0x4001240C)
#define ADC1_SMPR2	(*(volatile uint32_t*)0x40012410)
#define ADC1_JOFR1	(*(volatile uint32_t*)0x40012414)
#define ADC1_JOFR2	(*(volatile uint32_t*)0x40012418)
#define ADC1_JOFR3	(*(volatile uint32_t*)0x4001241C)
#define ADC1_JOFR4	(*(volatile uint32_t*)0x40012420)
#define ADC1_HTR	(*(volatile uint32_t*)0x40012424)
#define ADC1_LTR	(*(volatile uint32_t*)0x40012428)
#define ADC1_SQR1	(*(volatile uint32_t*)0x4001242C)
#define ADC1_SQR2	(*(volatile uint32_t*)0x40012430)
#define ADC1_SQR3	(*(volatile uint32_t*)0x40012434)
#define ADC1_JSQR	(*(volatile uint32_t*)0x40012438)
#define ADC1_JDR1	(*(volatile uint32_t*)0x4001243C)
#define ADC1_JDR2	(*(volatile uint32_t*)0x40012440)
#define ADC1_JDR3	(*(volatile uint32_t*)0x40012444)
#define ADC1_JDR4	(*(volatile uint32_t*)0x40012448)
#define ADC1_JR		(*(volatile uint32_t*)0x4001244C)


/* DAC */
#define DAC_CR		(*(volatile uint32_t*)0x40007400)
#define DAC_SWTRIGR	(*(volatile uint32_t*)0x40007404)
#define DAC_DHR12R1	(*(volatile uint32_t*)0x40007408)
#define DAC_DHR12L1	(*(volatile uint32_t*)0x4000740C)
#define DAC_DHR8R1	(*(volatile uint32_t*)0x40007410)
#define DAC_DHR12R2	(*(volatile uint32_t*)0x40007414)
#define DAC_DHR12L2	(*(volatile uint32_t*)0x40007418)
#define DAC_DHR8R2	(*(volatile uint32_t*)0x4000741C)
#define DAC_DHR12RD	(*(volatile uint32_t*)0x40007420)
#define DAC_DHR12LD	(*(volatile uint32_t*)0x40007424)
#define DAC_DHR8RD	(*(volatile uint32_t*)0x40007428)
#define DAC_DOR1	(*(volatile uint32_t*)0x4000742C)
#define DAC_DOR2	(*(volatile uint32_t*)0x40007430)
#define DAC_SR		(*(volatile uint32_t*)0x40007434)


/* PWR */
#define PWR_CR		(*(volatile uint32_t*)0x40007000)
#define PWR_CSR		(*(volatile uint32_t*)0x40007004)


/* Backup register */
#define BKP_DR1		(*(volatile uint16_t*)0x40006C04)
#define BKP_DR2		(*(volatile uint16_t*)0x40006C08)
#define BKP_DR3		(*(volatile uint16_t*)0x40006C0C)
#define BKP_DR4		(*(volatile uint16_t*)0x40006C10)
#define BKP_DR5		(*(volatile uint16_t*)0x40006C14)
#define BKP_DR6		(*(volatile uint16_t*)0x40006C18)
#define BKP_DR7		(*(volatile uint16_t*)0x40006C1C)
#define BKP_DR8		(*(volatile uint16_t*)0x40006C20)
#define BKP_DR9		(*(volatile uint16_t*)0x40006C24)
#define BKP_DR10	(*(volatile uint16_t*)0x40006C28)
#define BKP_RTCCR	(*(volatile uint16_t*)0x40006C2C)
#define BKP_CR		(*(volatile uint16_t*)0x40006C30)
#define BKP_CSR		(*(volatile uint16_t*)0x40006C34)


/* CEC */
#define CEC_CFGR	(*(volatile uint16_t*)0x40007800)
#define CEC_OAR		(*(volatile uint16_t*)0x40007804)
#define CEC_PRE		(*(volatile uint16_t*)0x40007808)
#define CEC_ESR		(*(volatile uint16_t*)0x4000780C)
#define CEC_CSR		(*(volatile uint16_t*)0x40007810)
#define CEC_TXD		(*(volatile uint16_t*)0x40007814)
#define CEC_RXD		(*(volatile uint16_t*)0x40007818)


/* AFIO */
#define AFIO_MAPR		(*(volatile uint32_t*)0x40010004)
#define AFIO_EXTICR1	(*(volatile uint32_t*)0x40010008)
#define AFIO_EXTICR2	(*(volatile uint32_t*)0x4001000C)
#define AFIO_EXTICR3	(*(volatile uint32_t*)0x40010010)
#define AFIO_EXTICR4	(*(volatile uint32_t*)0x40010014)
#define AFIO_MAPR2		(*(volatile uint32_t*)0x40010018)


/* EXTI */
#define EXTI_IMR	(*(volatile uint32_t*)0x40010400)
#define EXTI_EMR	(*(volatile uint32_t*)0x40010400)
#define EXTI_RTSR	(*(volatile uint32_t*)0x40010400)
#define EXTI_FTSR	(*(volatile uint32_t*)0x40010400)
#define EXTI_SWIER	(*(volatile uint32_t*)0x40010400)
#define EXTI_PR		(*(volatile uint32_t*)0x40010400)


/* GPIOA */
#define GPIOA		( (volatile uint32_t*)0x40010800)
#define GPIOA_CRL	(*(volatile uint32_t*)0x40010800)
#define GPIOA_CRH	(*(volatile uint32_t*)0x40010804)
#define GPIOA_IDR	(*(volatile uint32_t*)0x40010808)
#define GPIOA_ODR	(*(volatile uint32_t*)0x4001080C)
#define GPIOA_BSRR	(*(volatile uint32_t*)0x40010810)
#define GPIOA_BRR	(*(volatile uint32_t*)0x40010814)
#define GPIOA_LCKR	(*(volatile uint32_t*)0x40010818)


/* GPIOB */
#define GPIOB		( (volatile uint32_t*)0x40010C00)
#define GPIOB_CRL	(*(volatile uint32_t*)0x40010C00)
#define GPIOB_CRH	(*(volatile uint32_t*)0x40010C04)
#define GPIOB_IDR	(*(volatile uint32_t*)0x40010C08)
#define GPIOB_ODR	(*(volatile uint32_t*)0x40010C0C)
#define GPIOB_BSRR	(*(volatile uint32_t*)0x40010C10)
#define GPIOB_BRR	(*(volatile uint32_t*)0x40010C14)
#define GPIOB_LCKR	(*(volatile uint32_t*)0x40010C18)


/* GPIOC */
#define GPIOC		( (volatile uint32_t*)0x40011000)
#define GPIOC_CRL	(*(volatile uint32_t*)0x40011000)
#define GPIOC_CRH	(*(volatile uint32_t*)0x40011004)
#define GPIOC_IDR	(*(volatile uint32_t*)0x40011008)
#define GPIOC_ODR	(*(volatile uint32_t*)0x4001100C)
#define GPIOC_BSRR	(*(volatile uint32_t*)0x40011010)
#define GPIOC_BRR	(*(volatile uint32_t*)0x40011014)
#define GPIOC_LCKR	(*(volatile uint32_t*)0x40011018)


/* GPIOD */
#define GPIOD		( (volatile uint32_t*)0x40011400)
#define GPIOD_CRL	(*(volatile uint32_t*)0x40011400)
#define GPIOD_CRH	(*(volatile uint32_t*)0x40011404)
#define GPIOD_IDR	(*(volatile uint32_t*)0x40011408)
#define GPIOD_ODR	(*(volatile uint32_t*)0x4001140C)
#define GPIOD_BSRR	(*(volatile uint32_t*)0x40011410)
#define GPIOD_BRR	(*(volatile uint32_t*)0x40011414)
#define GPIOD_LCKR	(*(volatile uint32_t*)0x40011418)


/* GPIOE */
#define GPIOE		( (volatile uint32_t*)0x40011800)
#define GPIOE_CRL	(*(volatile uint32_t*)0x40011800)
#define GPIOE_CRH	(*(volatile uint32_t*)0x40011804)
#define GPIOE_IDR	(*(volatile uint32_t*)0x40011808)
#define GPIOE_ODR	(*(volatile uint32_t*)0x4001180C)
#define GPIOE_BSRR	(*(volatile uint32_t*)0x40011810)
#define GPIOE_BRR	(*(volatile uint32_t*)0x40011814)
#define GPIOE_LCKR	(*(volatile uint32_t*)0x40011818)


