Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/stm32/STM32F100.h
/* GPIOF */
#define GPIOF		( (volatile uint32_t*)0x40011C00)
#define GPIOF_CRL	(*(volatile uint32_t*)0x40011C00)
#define GPIOF_CRH	(*(volatile uint32_t*)0x40011C04)
#define GPIOF_IDR	(*(volatile uint32_t*)0x40011C08)
#define GPIOF_ODR	(*(volatile uint32_t*)0x40011C0C)
#define GPIOF_BSRR	(*(volatile uint32_t*)0x40011C10)
#define GPIOF_BRR	(*(volatile uint32_t*)0x40011C14)
#define GPIOF_LCKR	(*(volatile uint32_t*)0x40011C18)


/* GPIOG */
#define	GPIOG		( (volatile uint32_t*)0x40012000)
#define GPIOG_CRL	(*(volatile uint32_t*)0x40012000)
#define GPIOG_CRH	(*(volatile uint32_t*)0x40012004)
#define GPIOG_IDR	(*(volatile uint32_t*)0x40012008)
#define GPIOG_ODR	(*(volatile uint32_t*)0x4001200C)
#define GPIOG_BSRR	(*(volatile uint32_t*)0x40012010)
#define GPIOG_BRR	(*(volatile uint32_t*)0x40012014)
#define GPIOG_LCKR	(*(volatile uint32_t*)0x40012018)


/* Flash Interface */
#define FLASH_ACR		(*(volatile uint32_t*)0x40022000)
#define FLASH_KEYR		(*(volatile uint32_t*)0x40022004)
#define FLASH_OPTKEYR	(*(volatile uint32_t*)0x40022008)
#define FLASH_SR		(*(volatile uint32_t*)0x4002200C)
#define FLASH_CR		(*(volatile uint32_t*)0x40022010)
#define FLASH_AR		(*(volatile uint32_t*)0x40022014)
#define FLASH_OBR		(*(volatile uint32_t*)0x4002201C)
#define FLASH_WRPR		(*(volatile uint32_t*)0x40022020)


/* Cortex-M3 System timer */
#define	SYST_CSR	(*(volatile uint32_t*)0xE000E010)
#define	SYST_RVR	(*(volatile uint32_t*)0xE000E014)
#define	SYST_CVR	(*(volatile uint32_t*)0xE000E018)
#define	SYST_CALIB	(*(volatile uint32_t*)0xE000E01C)

/* Cortex-M3 NVIC */
#define	ISER		( (volatile uint32_t*)0xE000E100)
#define	ICER		( (volatile uint32_t*)0xE000E180)
#define	ISPR		( (volatile uint32_t*)0xE000E200)
#define	ICPR		( (volatile uint32_t*)0xE000E280)
#define	IABR		( (volatile uint32_t*)0xE000E300)
#define	IPR			( (volatile uint8_t *)0xE000E400)
#define	STIR		(*(volatile uint32_t*)0xE000EF00)

/* Cortex-M3 SCB */
#define	ACTLR		(*(volatile uint32_t*)0xE000E008)
#define	CPUID		(*(volatile uint32_t*)0xE000ED00)
#define	ICSR		(*(volatile uint32_t*)0xE000ED04)
#define	VTOR		(*(volatile uint32_t*)0xE000ED08)
#define	AIRCR		(*(volatile uint32_t*)0xE000ED0C)
#define	SCR			(*(volatile uint32_t*)0xE000ED10)
#define	CCR			(*(volatile uint32_t*)0xE000ED14)
#define	SHPR		( (volatile uint8_t *)0xE000ED14)
#define	CFSR		(*(volatile uint32_t*)0xE000ED28)
#define	MMSR		(*(volatile uint32_t*)0xE000ED28)
#define	BFSR		(*(volatile uint32_t*)0xE000ED29)
#define	UFSR		(*(volatile uint32_t*)0xE000ED2A)
#define	HFSR		(*(volatile uint32_t*)0xE000ED2C)
#define	MMFAR		(*(volatile uint32_t*)0xE000ED34)
#define	BFAR		(*(volatile uint32_t*)0xE000ED38)



/*--------------------------------------------------------------*/
/* Cortex-M3 core/peripheral access macros                      */
/*--------------------------------------------------------------*/

/* These are for only privileged mode */
#define __enable_irq() asm volatile ("CPSIE i\n")
#define __disable_irq() asm volatile ("CPSID i\n")
#define __enable_irqn(n) ISER[(n) / 32] = 1 << ((n) % 32)
#define __disable_irqn(n) ICER[(n) / 32] = 1 << ((n) % 32)
#define __test_irqn_enabled(n) (ISER[(n) / 32] & (1 << ((n) % 32)))
#define __set_irqn(n) ISPR[(n) / 32] = 1 << ((n) % 32)
#define __clear_irqn(n) ICPR[(n) / 32] = 1 << ((n) % 32)
#define __test_irqn(n) (ICPR[(n) / 32] & (1 << ((n) % 32)))
#define __test_irqn_active(n) (IABR[n / 32] & (1 << ((n) % 32)))
#define __set_irqn_priority(n,v) IPR[n] = (v)
#define __set_faultn_priority(n,v) SHPR[(n) + 16] = (v)
#define __get_MSP()			({uint32_t __rv; asm ("MRS %0, MSP\n"		: "=r" (__rv)); __rv;})
#define __get_PSP()			({uint32_t __rv; asm ("MRS %0, PSP\n"		: "=r" (__rv)); __rv;})
#define __get_PRIMASK() 	({uint32_t __rv; asm ("MRS %0, PRIMASK\n"	: "=r" (__rv)); __rv;})
#define __get_FAULTMASK()	({uint32_t __rv; asm ("MRS %0, FAULTMASK\n"	: "=r" (__rv)); __rv;})
#define __get_BASEPRI() 	({uint32_t __rv; asm ("MRS %0, BASEPRI\n"	: "=r" (__rv)); __rv;})
#define __get_CONTROL()		({uint32_t __rv; asm ("MRS %0, CONTROL\n"	: "=r" (__rv)); __rv;})
#define __set_MSP(arg)		{uint32_t __v=arg; asm ("MSR MSP, %0\n" 		:: "r" (__v));}
#define __set_PSP(arg)		{uint32_t __v=arg; asm ("MSR PSP, %0\n" 		:: "r" (__v));}
#define __set_PRIMASK(arg)	{uint32_t __v=arg; asm ("MSR PRIMASK, %0\n" 	:: "r" (__v));}
#define __set_FAULTMASK(arg) {uint32_t __v=arg; asm ("MSR FAULTMASK, %0\n" 	:: "r" (__v));}
#define __set_BASEPRI(arg)	{uint32_t __v=arg; asm ("MSR BASEPRI, %0\n" 	:: "r" (__v));}
#define __set_CONTORL(arg)	{uint32_t __v=arg; asm ("MSR CONTROL, %0\nISB\n" :: "r" (__v));}

/* These functions and macros are alternative of above for user mode */
#if USE_SV_SERVICE
#define __enable_irq_user()		asm volatile ("SVC #0\n")	/* CPSIE i */
#define __disable_irq_user()	asm volatile ("SVC #1\n")	/* CPSID i */
#define __enable_irq_user()		asm volatile ("SVC #2\n")	/* CPSIE f */
#define __disable_irq_user()	asm volatile ("SVC #3\n")	/* CPSID f */
uint32_t __get_scs_reg (volatile uint32_t* reg);			/* Read a register in SCS */
void __set_scs_reg (volatile uint32_t* reg, uint32_t val);	/* Write a register in SCS */
#define __enable_irqn_user(n) __set_scs_reg(&ISER[((n) / 32)], 1 << ((n) % 32))
#define __disable_irqn_user(n) __set_scs_reg(&ISCR[((n) / 32)], 1 << ((n) % 32))
#define __test_irqn_enabled_user(n) (__get_scs_reg(&ISCR[(n) / 32]) & (1 << ((n) % 32)))
#define __set_irqn_user(n) __set_scs_reg(&ISPR[((n) / 32)], 1 << ((n) % 32))
#define __clear_irqn_user(n) __set_scs_reg(&ICPR[((n) / 32)], 1 << ((n) % 32))
#define __test_irqn_user(n) (__get_scs_reg(&ICPR[(n) / 32]) & (1 << ((n) % 32)))
#define __test_active_irqn_user(n) (__get_scs_reg(&IABR[(n) / 32]) & (1 << ((n) % 32)))
#define __set_irqn_priority_user(n,v) __set_scs_reg(&IPR[n], (v))
#define __set_faultn_priority_user(n,v) __set_scs_reg(&SHPR[(n) + 16], (v))
#endif

/* These functions/macros can be used at user/privileged mode */
#define __REV(arg)		({uint32_t __r, __v=arg; asm ("REV %0,%1\n"   : "=r" (__r) : "r" (__v) ); __r;})
#define __REV16(arg)	({uint32_t __r, __v=arg; asm ("REV16 %0,%1\n" : "=r" (__r) : "r" (__v) ); __r;})
#define __REVSH(arg)	({uint32_t __r, __v=arg; asm ("REVSH %0,%1\n" : "=r" (__r) : "r" (__v) ); __r;})
#define __RBIT(arg)		({uint32_t __r, __v=arg; asm ("RBIT %0,%1\n"  : "=r" (__r) : "r" (__v) ); __r;})
#define __LDREXB(p)		({uint8_t __r;	asm ("LDREXB %0,[%1]\n" : "=r" (__r) : "r" (p)); __r;})
#define __LDREXH(p)		({uint16_t __r;	asm ("LDREXH %0,[%1]\n" : "=r" (__r) : "r" (p)); __r;})
#define __LDREXW(p)		({uint32_t __r;	asm ("LDREX  %0,[%1]\n" : "=r" (__r) : "r" (p)); __r;})
#define __STREXB(d,p)	({register uint32_t __r asm("r2"); register uint8_t __d asm("r1") = d; register volatile uint8_t *__p asm("r0") = p; asm ("STREXB %0,%2,[%1]\n" : "=r" (__r) : "r" (__p), "r" (__d)); __r;})
#define __STREXH(d,p)	({register uint32_t __r asm("r2"); register uint16_t __d asm("r1") = d; register volatile uint16_t *__p asm("r0") = p; asm ("STREXH %0,%2,[%1]\n" : "=r" (__r) : "r" (p), "r" (__d)); __r;})
#define __STREXW(d,p)	({register uint32_t __r asm("r2"); register uint32_t __d asm("r1") = d; register volatile uint32_t *__p asm("r0") = p; asm ("STREX  %0,%2,[%1]\n" : "=r" (__r) : "r" (p), "r" (__d)); __r;})
#define __CLREX() asm volatile ("CLREX\n")
#define __SEV() asm volatile ("SEV\n")
#define __WFE() asm volatile ("WFE\n")
#define __WFI() asm volatile ("WFI\n")

/* STM32F100 IRQ number */
#define MemManage_IRQn			(-12)
#define BusFault_IRQn			(-11)
#define UsageFault_IRQn			(-10)
#define SVC_IRQn				(-5)
#define DebugMon_IRQn			(-4)
#define PendSV_IRQn				(-2)
#define SysTick_IRQn			(-1)
#define WWDG_IRQn				0
#define PVD_IRQn				1
#define TAMPER_STAMP_IRQn		2
#define RTC_WKUP_IRQn			3
#define FLASH_IRQn				4
#define RCC_IRQn				5
#define EXTI0_IRQn				6
#define EXIT1_IRQn				7
#define EXTI2_IRQn				8
#define EXTI3_IRQn				9
#define EXTI4_IRQn				10
#define DMA1_CH1_IRQn			11
#define DMA1_CH2_IRQn			12
#define DMA1_CH3_IRQn			13
#define DMA1_CH4_IRQn			14
#define DMA1_CH5_IRQn			15
#define DMA1_CH6_IRQn			16
#define DMA1_CH7_IRQn			17
#define ADC1_IRQn				18
#define EXTI9_5_IRQn			23
#define TIM1_BRK_TIM15_IRQn		24
#define TIM1_UP_TIM16_IRQn		25
#define TIM1_TRG_COM_TIM17_IRQn	26
#define TIM1_CC_IRQn			27
#define TIM2_IRQn				28
#define TIM3_IRQn				29
#define TIM4_IRQn				30
#define I2C1_EV_IRQn			31
#define I2C1_ER_IRQn			32
#define I2C2_EV_IRQn			33
#define I2C2_ER_IRQn			34
#define SPI1_IRQn				35
#define SPI2_IRQn				36
#define USART1_IRQn				37
#define USART2_IRQn				38
#define USART3_IRQn				39
#define EXTI15_10_IRQn			40
#define RTC_Alarm_IRQn			41
#define CEC_IRQn				42
#define TIM12_IRQn				43
#define TIM13_IRQn				44
#define TIM14_IRQn				45
#define FSMC_IRQn				48
#define TIM5_IRQn				50
#define SPI3_IRQn				51
#define UART4_IRQn				52
#define UART5_IRQn				53
#define TIM6_DAC_IRQn			54
#define TIM7_IRQn				55
#define DMA2_CH1_IRQn			56
#define DMA2_CH2_IRQn			57
#define DMA2_CH3_IRQn			58
#define DMA2_CH4_IRQn			59
#define DMA2_CH5_IRQn			60


/* STM32F100 GPIO contorls */
#define __gpio_conf_bit(p,b,f)	p[b/8] = (p[b/8] & ~(0xF << ((b % 8) * 4))) | (f << ((b % 8) * 4))
#define __gpio_conf_lo8(p,f7,f6,f5,f4,f3,f2,f1,f0)	p[0] = f7<<28|f6<<24|f5<<20|f4<<16|f3<<12|f2<<8|f1<<4|f0
#define __gpio_conf_hi8(p,ff,fe,fd,fc,fb,fa,f9,f8)	p[1] = ff<<28|fe<<24|fd<<20|fc<<16|fb<<12|fa<<8|f9<<4|f8
#define IN_ANA	0x0
#define IN_HIZ	0x4
#define IN_PUL	0x8
#define OUT_PP	0x3
#define OUT_OD	0x7
#define ALT_PP	0xB
#define ALT_OD	0xF


/* STM32F100 peripheral contorls */
#define __enable_peripheral(p)	(&RCC_AHBENR)[p/32] |= 1 << (p % 32)
#define __disable_peripheral(p)	(&RCC_AHBENR)[p/32] &= ~(1 << (p % 32))
#define __reset_peripheral(p)	{(&RCC_CIR)[p/32] |= 1 << (p % 32); (&RCC_CIR)[p/32] &= ~(1 << (p % 32)); }
#define DMA1EN		0
#define DMA2EN		1
#define SRAMEN		2
#define FLITFEN		4
#define CRCEN		6
#define FSMCEN		8
#define AFIOEN		32
#define IOPAEN		34
#define IOPBEN		35
#define IOPCEN		36
#define IOPDEN		37
#define IOPEEN		38
#define IOPFEN		39
#define IOPGEN		40
#define ADC1EN		41
#define TIM1EN		43
#define SPI1EN		44
#define USART1EN	46
#define TIM15EN		48
#define TIM16EN		49
#define TIM17EN		50
#define TIM2EN		64
#define TIM3EN		65
#define TIM4EN		66
#define TIM5EN		67
#define TIM6EN		68
#define TIM7EN		69
#define TIM12EN		70
#define TIM13EN		71
#define TIM14EN		72
#define WWDGEN		75
#define SPI2EN		78
#define SPI3EN		79
#define USART2EN	81
#define USART3EN	82
#define UART4EN		83
#define UART5EN		84
#define I2C1EN		85
#define I2C2EN		86
#define BKPEN		91
#define PWREN		92
#define DACEN		93
#define CECEN		94



/*--------------------------------------------------------------*/
/* Misc Macros                                                  */
/*--------------------------------------------------------------*/

/* Bit definitions */
#define	_BV(bit) (1<<(bit))

/* Import a binary file */
#define	IMPORT_BIN(sect, file, sym) asm (\
		".section " #sect "\n"                  /* Change section */\
		".balign 4\n"                           /* Word alignment */\
		".global " #sym "\n"                    /* Export the object address to other modules */\
		#sym ":\n"                              /* Define the object label */\
		".incbin \"" file "\"\n"                /* Import the file */\
		".global _sizeof_" #sym "\n"            /* Export the object size to oher modules */\
		".set _sizeof_" #sym ", . - " #sym "\n" /* Define the object size */\
		".balign 4\n"                           /* Word alignment */\
		".section \".text\"\n")                 /* Restore section */

/* Import a part of binary file */
#define	IMPORT_BIN_PART(sect, file, ofs, siz, sym) asm (\
		".section " #sect "\n"\
		".balign 4\n"\
		".global " #sym "\n"\
		#sym ":\n"\
		".incbin \"" file "\"," #ofs "," #siz "\n"\
		".global _sizeof_" #sym "\n"\
		".set _sizeof_" #sym ", . - " #sym "\n"\
		".balign 4\n"\
		".section \".text\"\n")

/* Jump to secondary application */
#define JUMP_APP(appvt) asm (\
		"LDR SP, [%0]\n"          /* Initialize SP */\
		"LDR PC, [%0, #4]\n"      /* Go to reset vector */\
        : : "r" (appvt))


#endif /* __LPC176x */
